{
  "stages": [
    {
      "name": "Cultivation",
      "description": "Coffee cultivation begins with selecting high-quality coffee seeds, typically grown in nurseries, before being transplanted to farms. The plants require specific climate conditions—temperature, altitude, and rainfall play crucial roles. Sustainable farming practices, such as shade-grown coffee, organic fertilizers, and biodiversity conservation, help ensure quality and environmental responsibility.",
      "image": "cultivation.jpeg",
      "alt" : "image of coffee beans plants"

    },
    {
      "name": "Harvesting",
      "description": "Coffee cherries are harvested when they reach peak ripeness, usually indicated by their deep red colour. Farmers either hand-pick the cherries for quality control or use mechanical harvesters for efficiency. Selective picking ensures that only ripe cherries are collected; this improves the overall flavour profile of the coffee.",
      "image": "harvesting.jpeg",
      "alt" : "image of a person collecting coffee beans"

    },
    {
      "name": "Processing",
      "description": "After harvesting, the coffee cherries undergo processing to remove the outer fruit and extract the beans. There are two main methods: the washed (wet) process, which involves fermenting and washing the cherries to remove pulp, and the natural (dry) process, where cherries are sun-dried before hulling. The processing method affects the coffee’s flavour, acidity, and body.",
      "image": "processing.png",
      "alt" : "image of machine processing the beans"
    },
    {
      "name": "Drying",
      "description": "Coffee beans must be dried to reach an optimal moisture content before storage and export. This can be done by sun-drying the beans on large patios or using mechanical dryers. Proper drying prevents mould growth and maintains bean quality. Sun drying is common in traditional farming, whereas mechanical dryers help speed up the process in regions with high humidity.",
      "image": "drying.jpeg",
      "alt" : "image of the coffee beans drying on tables"
    },
    {
      "name": "Exporting",
      "description": "Once dried, the coffee beans (now called green coffee beans) are packed into burlap sacks or other protective packaging and shipped worldwide. The export process involves quality control checks, grading, and proper documentation to ensure traceability. Blockchain technology can play a key role here by recording data on each coffee batch's origin, quality, and transactions.",
      "image": "exporting.jpeg",
      "alt" : "image of coffee beans in sacks"
    },
    {
      "name": "Roasting",
      "description": "Green coffee beans are roasted at high temperatures to develop their aroma, flavour, and colour. The roasting process involves careful temperature control—light roasts preserve acidity, while dark roasts enhance boldness and bitterness. Each coffee brand has unique roasting profiles that influence the final taste.",
      "image": "roasting.jpeg",
      "alt" : "image of machine roasting coffee beans"
    },
    {
      "name": "Packaging",
      "description": "After roasting, the coffee is packaged to preserve freshness and flavour. Packaging includes whole beans or ground coffee in vacuum-sealed bags, nitrogen-flushed packs, or traditional paper bags. Labels provide details on origin, roast level, and certifications such as Fairtrade or organic status. Blockchain can enhance transparency by allowing consumers to scan QR codes to trace the coffee’s journey.",
      "image": "packaging.jpeg",
      "alt" : "image of multiple coffee bean products"
    },
    {
      "name": "Distribution",
      "description": "The final stage involves distributing coffee to retailers, cafes, and consumers. Supply chain logistics ensure that coffee reaches its destination efficiently while maintaining quality. Blockchain-based tracking systems provide real-time updates on shipment status, helping to prevent fraud and ensure ethical sourcing.",
      "image": "distribution.jpeg",
      "alt" : "image of lorry on a road"
    }
  ]
}
